systemtest/testcases_services/test_wcps/queries/01-soap_encode.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
    <env:Header/>
    <env:Body>
  <ProcessCoveragesRequest xmlns="http://www.opengis.net/wcps/1.0" service="WCPS" version="1.0.0">
<query><xmlSyntax><coverageIterator><iteratorVar>c</iteratorVar><coverageName>test_rgb</coverageName></coverageIterator><encode store="false"><coverage>c</coverage><format>png</format></encode></xmlSyntax></query></ProcessCoveragesRequest>
    </env:Body>
</env:Envelope>
